# -*- coding: utf-8 -*-

with open("chapter_14.md", "r", encoding="utf-8") as f:
    text = f.read()

t = "Первая линия обороны Врат осталась позади. Но впереди лежали внутренние шлюзы, где каждый шаг путников взвешивался безжалостными законами империи."
r = """Первая линия обороны Врат осталась позади. Но впереди лежали внутренние шлюзы, где каждый шаг путников взвешивался безжалостными законами империи.

В воздухе гулко вибрировал низкий гул гидравлических насосов, а впереди, за поворотом мрачного коридора, уже разгорались багровые огни Среднего шлюза. Городская цитадель не отпускала своих гостей без боя."""

assert t in text
text = text.replace(t, r, 1)

with open("chapter_14.md", "w", encoding="utf-8") as f:
    f.write(text)

print("Added ch14 words.")
